---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeDefinition
source: html/783e6954-0bb1-005b-ca6e-97159ed38d2e.htm
---
# RebarShapeDefinition Members

Add a formula-driven parameter to the shape definition.